payloads/soap.xml


<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <ns3:SendMessage xmlns:ns3="http://bip.bee.kz/SyncChannel/v10/Types" xmlns="">
            <request>
                <requestInfo>
                    <messageId>ccb1010b-8446-4937-913f-c87a717f6809</messageId>
                    <serviceId>GBDFL_UniversalServiceSync</serviceId>
                    <messageDate>2019-12-25T12:48:21.024Z</messageDate>
                    <sender>
                        <senderId>smartbridge</senderId>
                        <password>123</password>
                    </sender>
                    <properties>
                        <key>CONNECTOR_CLIENT</key>
                        <value>true</value>
                    </properties>
                </requestInfo>
                <requestData>
                    <ns4:data xmlns:ns4="http://bip.bee.kz/SyncChannel/v10/Interfaces" xmlns:cs="http://message.persistence.interactive.nat" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="cs:Request">
                        <messageId>1</messageId>
                        <messageDate>2017-10-12T15:22:16.183+06:00</messageDate>
                        <senderCode>smartbridge</senderCode>
                        <iin>931002451325</iin>
                    </ns4:data>
                </requestData>
            </request>
        </ns3:SendMessage>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>