src/main/resources/templates/template.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
        <ns2:SendMessage xmlns:ns2="http://bip.bee.kz/SyncChannel/v10/Types">
            <request>
                <requestInfo>
                    <messageId>%s</messageId>
                    <serviceId>%s</serviceId>
                    <messageDate>%s</messageDate>
                    <sender>
                        <senderId>%s</senderId>
                        <password>%s</password>
                    </sender>
                </requestInfo>
                <requestData>
                    <data xmlns:ns4="http://kz.ngrk.types" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns4:MessageBody">
                        <header>
                            <sender>
                                <code>%s</code>
                            </sender>
                            <messageID>%s</messageID>
                            <recipients>
                                <code>%s</code>
                            </recipients>
                            <messageType>%s</messageType>
                            <messageDate>%s</messageDate>
                            <interactionType>%s</interactionType>
                        </header>
                        <segment>
                            <packageID>%s</packageID>
                            <segmentCount>%s</segmentCount>
                            <segmentIndex>%s</segmentIndex>
                            <zip>%s</zip>
                        </segment>
                    </data>
                </requestData>
            </request>
        </ns2:SendMessage>
    </soap:Body>
</soap:Envelope>