b

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:data="http://data.gbd.chdb.scb.kz/">
   <soapenv:Header>
   	<userId>USER_ID</userId>
   </soapenv:Header>
   <soapenv:Body>
      <data:getPerson>
         <iin>660427402182</iin>
         <consentConfirmed>true</consentConfirmed>
      </data:getPerson>
   </soapenv:Body>
</soapenv:Envelope>
